spark-python/pyspark-metastore/README.md
```mermaid
flowchart TD
    subgraph PySparkMetastore
        subgraph Spark
            Driver
            Executors
        end

        subgraph "Apache Hive"
            LLAP_Daemons
            Hiveserver_Tez
        end

        subgraph Metastore
            Spark_Metadata
            Hive_Metadata
        end
    end

    Driver --down--> Spark_Metadata
    Hiveserver_Tez --down--> Hive_Metadata
    Executors --right--> LLAP_Daemons
    Driver --right--> Hiveserver_Tez
```
